[
  {
    "id": 1,
    "title": "Интерстеллар",
    "year": 2014,
    "genre": "Фантастика",
    "rating": 8.7,
    "description": "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
    "favorite": true
  },
  {
    "id": 2,
    "title": "Начало",
    "year": 2010,
    "genre": "Детектив",
    "rating": 8.7,
    "description": "Кобб — талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим.",
    "favorite": true
  },
  {
    "id": 3,
    "title": "Побег из Шоушенка",
    "year": 1994,
    "genre": "Драма",
    "rating": 9.1,
    "description": "Бухгалтер Энди Дюфрейн обвинён в убийстве собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, он сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки.",
    "favorite": false
  },
  {
    "id": 4,
    "title": "Один дома",
    "year": 1990,
    "genre": "Комедия",
    "rating": 8.3,
    "description": "Американское семейство отправляется из Чикаго в Европу, но в спешке сборов бестолковые родители забывают дома... одного из своих детей. Юное создание, однако, не теряется и демонстрирует чудеса изобретательности. И когда в дом залезают грабители, им приходится не раз пожалеть о встрече с милым крошкой.",
    "favorite": false
  },
  {
    "id": 5,
    "title": "Остров проклятых",
    "year": 2009,
    "genre": "Драма",
    "rating": 8.6,
    "description": "Два американских судебных пристава отправляются на один из островов в штате Массачусетс, чтобы расследовать исчезновение пациентки клиники для умалишенных преступников. При проведении расследования им придется столкнуться с паутиной лжи, обрушившимся ураганом и смертельным бунтом обитателей клиники.",
    "favorite": false
  }
]
